---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManagerIterator.IsDone
source: html/81e77b23-56b3-1331-7c7a-75bcd3e2ec64.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.